# Global variable
#########################################################
wkd=' '
 
#########################################################

start=$(date +%s) #脚本启始时间
echo '脚本开始执行'

#########################################################
# Main program

cd fq
 for i in $wkd/dataset/*sra
do
        echo $i
        fastq-dump --split-3 --skip-technical --clip --gzip $i  
done





#########################################################

end=$(date +%s) #脚本终止时间
take=$(( end - start ))
h=$(( take / 3600 ))
m=$((( take - 3600 * h ) / 60 ))
s=$((( take - 3600 * h - 60 * m )))
echo 脚本运行完毕用时 ${h} 小时 ${m} 分钟 ${s} 秒

#########################################################